%dierti 36风速最优
LLL=ones(1,2180000);
LLL=LLL*90;
for x=0:0.0001:2; %x是吃水深度  水下的高度
    for y=130:1:215 
      
       M4=6060;
        gg=9.8;%重力加速度   
        G4=M4*gg;
        G1=1000*gg;%浮标重力
        h1=2;%浮标高度
        F1=0.625*2*(2-x)*36^2;%风的推力
        B1=x*1*pi*1025*gg;%浮标收到的浮力
        T(1)=sqrt((B1-G1)^2+F1^2);%第一根钢管的拉力
        a(1)=atan((B1-G1)/F1);%第一根钢管和水平方向的夹角(弧度制)
        b(1)=a(1)*180/pi;
        L1=1;
        L2=0.105;
        
        G2=10*gg;   %钢棍重力
        B2=1*0.05^2*pi*1025*gg;           %钢棍所受浮力
        for n=2:1:4
            T(n)=sqrt((B2-G2+T(n-1)*sin(a(n-1)))^2+(T(n-1)*cos(a(n-1)))^2);%钢棍拉力
            a(n)=atan(((B2-G2+T(n-1)*sin(a(n-1))))/(T(n-1)*cos(a(n-1))));
            b(n)=a(n)*180/pi;        %钢棍水平夹角
        end
        
        G3=100*gg;    %设备重力
        B3=1*0.3^2*pi*1025*gg;   %设备浮力
        T(5)=sqrt((B3-G3+T(4)*sin(a(4)))^2+(T(4)*cos(a(4)))^2);%系统拉力
        a(5)=atan(((B3-G3+T(4)*sin(a(4))))/(T(4)*cos(a(4))));
        b(5)=a(5)*180/pi   ;    %系统水平夹角
       %peizhong重力
        B4=G4*1025/7850;   %设备浮力
        T(6)=sqrt((B4-G4+T(5)*sin(a(5)))^2+(T(5)*cos(a(5)))^2);%系统拉力
        a(6)=atan(((B4-G4+T(5)*sin(a(5))))/(T(5)*cos(a(5))));
        b(6)=a(6)*180/pi        ;
        
        G5=0.105*7*gg;    %maolianyige重力
        B5=0.105*7*1025/7850*gg;   %锚链一环浮力
        for n=7:1:y
            T(n)=sqrt((B5-G5+T(n-1)*sin(a(n-1)))^2+(T(n-1)*cos(a(n-1)))^2);%钢棍拉力
            a(n)=atan(((B5-G5+T(n-1)*sin(a(n-1))))/(T(n-1)*cos(a(n-1))));
            b(n)=a(n)*180/pi;
        end
        for n=y+1:1:215
            a(n)=0;
            b(n)=0;
        end
        
        LL(y*10000+x*10000)=0;
        c(1)=0;
        d(1)=0;
        for n=1:1:5
            LL(y*10000+x*10000)=L1*sin(a(n))+LL(y*10000+x*10000);
            c(n+1)=-L1*sin(a(n))+c(n);
            d(n+1)=-L1*cos(a(n))+d(n);
        end
        
        for n=6:1:y
            LL(y*10000+x*10000)=L2*sin(a(n))+LL(y*10000+x*10000);
            c(n+1)=-L2*sin(a(n))+c(n);
            d(n+1)=-L2*cos(a(n))+d(n);
        end
        LL(y*10000+x*10000)=LL(y*10000+x*10000)+x;
        
        if (LL(y*10000+x*10000)-18<0.01 &0<=b(y) &18-LL(y*10000+x*10000)<0.01 & b(5)>85 & b(215)<16 )
            LLL(y*10000+x*10000)=b(215);
            LLLL(y*10000+x*10000)=b(5);
            for n=1:1:y+1
                e(n)=c(n)-x;
                f(n)=d(n);
            end
            for n=y+2:1:215
                e(n)=e(y+1);
                f(n)=f(n-1)-L2;
            end
            plot(f,e);
            hold on; 
            M4
        end
        

    end
end
