%disanti   海平面高度不一样
LLL=ones(1,2180000);
LLL=LLL*90;
v=24;
vv=0.5;
M4=1200;
for x=0:0.001:2; %x是吃水深度  水下的高度
    for y=130:1:215
        gg=9.8;%重力加速度
        G1=1000*gg;%浮标重力
        h1=2;%浮标高度
        F1=0.625*2*(2-x)*v^2;%风的推力
        FW1=374*x*2*vv^2;
        B1=x*1*pi*1025*gg;%浮标收到的浮力
        T(1)=sqrt((B1-G1)^2+(F1+FW1)^2);%第一根钢管的拉力
        a(1)=atan((B1-G1)/(F1+FW1));%第一根钢管和水平方向的夹角(弧度制)
        b(1)=a(1)*180/pi;
        L1=1;
        L2=0.105;
        
        G2=10*gg;   %钢棍重力
        B2=1*0.025^2*pi*1025*gg;           %钢棍所受浮力
        FW2=1*0.05*374*vv^2 ;   
        for n=2:1:4
            T(n)=sqrt((B2-G2+T(n-1)*sin(a(n-1)))^2+(FW2+T(n-1)*cos(a(n-1)))^2);%钢棍拉力
            a(n)=atan(((B2-G2+T(n-1)*sin(a(n-1))))/(FW2+T(n-1)*cos(a(n-1))));
            b(n)=a(n)*180/pi;        %钢棍水平夹角
        end
        
        G3=100*gg;    %设备重力
        B3=1*0.15^2*pi*1025*gg;   %设备浮力
         FW3=1*0.05*374*vv^2   ;
        T(5)=sqrt((B3-G3+T(4)*sin(a(4)))^2+(FW3+T(4)*cos(a(4)))^2);%系统拉力
        a(5)=atan(((B3-G3+T(4)*sin(a(4))))/(FW3+T(4)*cos(a(4))));
        b(5)=a(5)*180/pi   ;    %系统水平夹角
         G4=M4*gg;    %peizhong重力
        B4=G4*1025/7850;  %PEIZHONG浮力
        FW4=(0.75/pi*M4/7850)^(2/3)*pi;
        T(6)=sqrt((B4-G4+T(5)*sin(a(5)))^2+(FW4+T(5)*cos(a(5)))^2);%系统拉力
        a(6)=atan(((B4-G4+T(5)*sin(a(5))))/(FW4+T(5)*cos(a(5))));
        b(6)=a(6)*180/pi        ;
        
        G5=0.105*7*gg;    %maolianyige重力
        B5=0.105*7*1025/7850*gg;   %锚链一环浮力
        FW5=3.74*vv^2;
        for n=7:1:y
            T(n)=sqrt((B5-G5+T(n-1)*sin(a(n-1)))^2+(T(n-1)*cos(a(n-1)))^2);%钢棍拉力
            a(n)=atan(((B5-G5+T(n-1)*sin(a(n-1))))/(T(n-1)*cos(a(n-1))));
            b(n)=a(n)*180/pi;
        end
        for n=y+1:1:215
            a(n)=0;
            b(n)=0;
        end
        
        LL(y*100000+x*10000)=0;
        c(1)=0;
        d(1)=0;
        for n=1:1:215-y
            c(n+1)=0.105+c(n);
            d(n+1)=d(n);
        end
        for n=216-y:1:210
            c(n+1)=L2*cos(a(216-n))+c(n);
            d(n+1)=L2*sin(a(216-n))+d(n);
        end
         for n=211:1:215
            c(n+1)=L1*cos(a(216-n))+c(n);
            d(n+1)=L1*sin(a(216-n))+d(n);
         end
        c(217)=c(216);
         d(217)=d(216)+x;
        
        for n=1:1:5
            LL(y*100000+x*10000)=L1*sin(a(n))+LL(y*100000+x*10000);
           
        end
        
        for n=6:1:y
            LL(y*100000+x*10000)=L2*sin(a(n))+LL(y*100000+x*10000);   
        end
        LL(y*100000+x*10000)=LL(y*100000+x*10000)+x;
        
        if (0<=b(y) & abs(18-LL(y*100000+x*10000))<0.1 & b(5)>85 & b(y)<16)
            LLL(y*100000+x*10000)=abs(18-LL(y*100000+x*10000));
            LLLL(y*100000+x*10000)=b(5);
        
            
            plot(c,d);
      
            hold on;
        end
        
    end;
end

